########################################################################################################################
#                                             Практикум 3.8.19                                                         #
########################################################################################################################

n = int(input('Введите необходимое количество билетов: '))
total = 0

for i in range(1, n + 1):
    age = int(input(f'Введите возраст {i} посетителя: '))
    if 0 <= age < 18:
        total += 0
    elif 18 <= age <= 25:
        total += 990
    elif 25 < age <= 100:
        total += 1390
    else:
        print('Не корректный возраст, попробуйте заново')
        break
else:
    print(f'Общая стоимость билетов: {round(total) if n < 4 else round(total * 0.9)}')
